@echo off
chcp 65001 > nul
title КИС «Автосервис: Чип-тюнинг» (2026 г.)
echo ====================================================================
echo  КИС «АВТОСЕРВИС: ЧИП-ТЮНИНГ» — ЗАПУСК СИСТЕМЫ (2026 Г.)
echo  Разработчики: студенты гр. ЭАС-514С Гайнанов Д.И. и Гарифуллин К.Р.
echo  Преподаватель: ст. преподаватель Демченко М.С.
echo ====================================================================
echo.
echo Инициализация базы данных SQLite (3NF) и запуск HTTP-сервера...
cd /d "%~dp0"

start http://localhost:8000
python server.py

pause
